Revit 2027 API
ZoneEquipmentHvacType Enumeration
 The type of zone equipment.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ZoneEquipmentHvacType
Public Enumeration ZoneEquipmentHvacType
public enum class ZoneEquipmentHvacType
type ZoneEquipmentHvacType
Members
Member name | Value | Description
CAVBox | 9
ChilledBeamActive | 1
ChilledBeamPassive | 15
FourPipeFanCoil | 2
PackagedTerminalAirConditioner | 3
PackagedTerminalHeatPump | 4
ParallelFanPoweredBox | 5
RadiantPanel | 10
SeriesFanPoweredBox | 11
Unconditioned | 16
Undefined | 0
UnitHeater | 12
UnitVentilator | 13
VAVBox | 6
VRFFanCoil | 17
WaterSourceHeatPump | 14
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace